[x1 ,x2] = meshgrid(-1:0.001:1);
z = x1.^2+2*x2.^2+exp(x1.^2+x2.^2);
%surf(x1, x2, z)
hold on
contour(x1, x2, z)
%colorbar
shading interp % эта команда сглаживает поверхность

%lambda with plus
[x, y] =  fminsearch(@(x) (6+4*exp(x(1)^2+x(2)^2)+4*x(1)^2*exp(x(1)^2+x(2)^2)+4*x(2)^2*exp(x(1)^2+x(2)^2)+sqrt(4+16*x(2)^2*exp(x(1)^2+x(2)^2)+32*x(1)^2*x(2)^2*exp(2*(x(1)^2+x(2)^2))+16*x(1)^4*exp(2*(x(1)^2+x(2)^2))+16*x(2)^2*exp(2*(x(1)^2+x(2)^2))))/-2, [-0.1, 0])

%lambda with minus
[x, y] =  fminsearch(@(x) (6+4*exp(x(1)^2+x(2)^2)+4*x(1)^2*exp(x(1)^2+x(2)^2)+4*x(2)^2*exp(x(1)^2+x(2)^2)-sqrt(4+16*x(2)^2*exp(x(1)^2+x(2)^2)+32*x(1)^2*x(2)^2*exp(2*(x(1)^2+x(2)^2))+16*x(1)^4*exp(2*(x(1)^2+x(2)^2))+16*x(2)^2*exp(2*(x(1)^2+x(2)^2))))/-2, [-0.1, 0])


%geometric step
[x1 ,x2] = meshgrid(-1:0.001:1);
x = [1, 0.6086, 0.216054, 0.0562796, 0.0156928, 0.00439258, 0.00122989, 0.000344369];
y = [1, 0.561944, 0.078111, -0.00777293, 0.000630881, -5.05265e-05, 4.04247e-06, -3.234e-07];
z = x1.^2+2*x2.^2+exp(x1.^2+x2.^2);
%surf(x1, x2, z)
hold all
contour(x1, x2, z);
plot(x,y,'-x');
plot(0,0, 'rO');
%geometric BFGS
[x1 ,x2] = meshgrid(-1:0.001:1);
x = [1, 0.071950428508801, 0.007485496220110, 0.000079723392945];
y = [1, -0.038675792194324, 0.006926553808255, -0.000065190350168];
z = x1.^2+2*x2.^2+exp(x1.^2+x2.^2);
%surf(x1, x2, z)
hold all
contour(x1, x2, z);
plot(x,y,'-x');
plot(0,0, 'rO');